app/Helpers/Helper.php

select * from `companies` where `subdomain` = '127' and `companies`.`deleted_at` is null limit 1
---
function getSubdomainLogo()
{
    $url = \request()->getHttpHost();
    $subdomain = explode('.', $url)[0];
    $companyLogo = Company::where('subdomain', $subdomain)->with('info')->first();

select * from `companies` where `subdomain` = '127' and `companies`.`deleted_at` is null limit 1
---
function getSubdomainCompanyName()
{
    $url = \request()->getHttpHost();
    $subdomain = explode('.', $url)[0];
    $company = Company::where('subdomain', $subdomain)->first();